20220621/InformationRegisters/тм_СообщенияПользователям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>тм_СообщенияПользователям</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Архив</Name>
					<Comment>Удаленный чат</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрочтения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПользовательКому</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПользовательОтКого</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Срочно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

20220621/Catalogs/тм_Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>тм_Файлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторВладелецФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВладельца</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Comment>Нужен для определения файла в чате</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

20220621/InformationRegisters/тм_СообщенияПользователям/Ext/ManagerModule.bsl
#Область СлужубныеПроцедурыИФункции

Процедура ПрочитатьСообщение(ПараметрыОтбора) Экспорт
	
	Пока ПараметрыОтбора.Выборка.Следующий() Цикл
		
		НЗ = СоздатьНаборЗаписей();
		НЗ.Отбор.ИдентификаторСообщения.Установить(ПараметрыОтбора.ИдентификаторСообщения);
		НЗ.Отбор.Период.Установить(ПараметрыОтбора.Выборка.Период);
		НЗ.Прочитать();
		
		Для каждого СтрНЗ Из НЗ Цикл
			СтрНЗ.ДатаПрочтения = ТекущаяДатаСеанса();
			СтрНЗ.Прочитано = Истина;
			//СтрНЗ.Срочно = Ложь;
		КонецЦикла;  
		
		НЗ.Записать();
		
	КонецЦикла; 
	
КонецПроцедуры

Функция ЕстьРанееСозданныйЧат(Пользователь) Экспорт
	
	ИдентификаторСообщения = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	тм_СообщенияПользователям.ИдентификаторСообщения КАК ИдентификаторСообщения
		|ИЗ
		|	РегистрСведений.тм_СообщенияПользователям КАК тм_СообщенияПользователям
		|ГДЕ
		|	тм_СообщенияПользователям.ПользовательКому = &ПользовательКому
		|
		|УПОРЯДОЧИТЬ ПО
		|	тм_СообщенияПользователям.ИдентификаторСообщения УБЫВ";
	
	Запрос.УстановитьПараметр("ПользовательКому", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИдентификаторСообщения = Выборка.ИдентификаторСообщения;
		
	КонецЦикла;
	
	Возврат ИдентификаторСообщения;
	
КонецФункции	
 
Процедура ОтправитьСообщение(ПараметрыСообщения) Экспорт

	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.ИдентификаторСообщения.Установить(ПараметрыСообщения.ИдентификаторСообщения);
	НЗ.Прочитать();
	
	МЗ = НЗ.Добавить();		
	ЗаполнитьЗначенияСвойств(МЗ, ПараметрыСообщения);
	
	// Файлы
	Если ПараметрыСообщения.Свойство("Файлы") 
		И ПараметрыСообщения.Файлы <> Неопределено Тогда
		ТаблицаФайлов = ПолучитьИзВременногоХранилища(ПараметрыСообщения.Файлы);
		ЗагрузитьФайлы(ПараметрыСообщения, ТаблицаФайлов);
	КонецЕсли;  

	НЗ.Записать();
	
КонецПроцедуры

Процедура ЗагрузитьФайлы(ПараметрыСообщения, ТаблицаФайлов)
	
	НачатьТранзакцию();
	Попытка
		Для каждого СтрТаблицыФайлов Из ТаблицаФайлов Цикл
			спрФайл = Справочники.тм_Файлы.СоздатьЭлемент();
			спрФайл.ИдентификаторВладелецФайла  = ПараметрыСообщения.ИдентификаторСообщения;
			спрФайл.ТипВладельца 				= Тип("РегистрСведенийЗапись.тм_СообщенияПользователям");
			спрФайл.Автор 						= Пользователи.ТекущийПользователь();
			спрФайл.Расширение             		= СтрТаблицыФайлов.Расширение;
			спрФайл.ПутьКФайлу             		= СтрТаблицыФайлов.ПутьКФайлу;
			спрФайл.Размер                 		= СтрТаблицыФайлов.Размер;
			спрФайл.ИндексКартинки        		= РаботаСФайламиСлужебныйКлиентСервер.ПолучитьИндексПиктограммыФайла(СтрТаблицыФайлов.Расширение);
			спрФайл.ИдентификаторФайла     		= СтрТаблицыФайлов.ИдентификаторФайла;
			спрФайл.Наименование				= СтрТаблицыФайлов.Имя;
			спрФайл.ДатаЗаписи					= ПараметрыСообщения.Период;
			
			ДДФайла 							= ПолучитьИзВременногоХранилища(СтрТаблицыФайлов.Адрес); 	
			спрФайл.ФайлХранилище          		= Новый ХранилищеЗначения(ДДФайла);
			
			спрФайл.Записать();
		КонецЦикла; 
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ПараметрыСообщения.ОшибкиОтправки 	= "Проблема с загрузкой файлов: " + ОписаниеОшибки();	 
	КонецПопытки; 
	
КонецПроцедуры

// Помещение в архив сообщений.
// 
// Параметры:
//  ИдентификаторСообщения - Строка
Процедура ПоместитьВАрхив(ИдентификаторСообщения) Экспорт
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения);
	НЗ.Прочитать();
	
	ТЗ =  НЗ.Выгрузить();
	ТЗ.ЗаполнитьЗначения(Истина, "Архив");
	
	НЗ.Загрузить(ТЗ);
	НЗ.Записать();
					
КонецПроцедуры

#КонецОбласти
